DoS Testmessages/Axis2-EncSign_allowedInjectionPlaces.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:axis="http://axis21.kmzs.ba">
   <soap:Header $$PAYLOADATTR$$><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" $$PAYLOADATTR$$><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-AC5903F7D6DFBD4BC114743637262749"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="axis soap" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-AC5903F7D6DFBD4BC114743637262498"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="axis" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>nWg+hsaObx5HgEOgKyNbIIeOqUE=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Y/d1Ri5JVgmvKQCAz6i3DkBPcN2uxx56OGIWEiJwEmohjKSSXiHMxoq11GQieUT2lZqK8Gf+4+6n9fet2cLyKefeSdRtb82w7rTA28K9wIHERusRySRQBr/tdKOkyV55Wqlop3cpTLIPeijjL0SGPih01svTqJu/AP51qmVsFPNoOSNDXgweh4VW8FS0Lhf4Fc0ktORlcSCm1rqbPYmlQdrXD2ne01q9eUxDfhmGe6atwJzUeGJnhN2/t1Z4f8blZrobNLmoK1FwyTdrXun7ZKTMNcoexo5HfERkTa7SjheJziFJOc9h8opNgn3Pkz0Ezao1QFbEoUj/Pzf89rBbpQ==</ds:SignatureValue><ds:KeyInfo Id="KI-AC5903F7D6DFBD4BC114743637262406" $$PAYLOADATTR$$><wsse:SecurityTokenReference $$PAYLOADATTR$$ wsu:Id="STR-AC5903F7D6DFBD4BC114743637262407"><ds:X509Data $$PAYLOADATTR$$><ds:X509IssuerSerial><ds:X509IssuerName>CN=client</ds:X509IssuerName><ds:X509SerialNumber>1034513739</ds:X509SerialNumber></ds:X509IssuerSerial>$$PAYLOADELEMENT$$</ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo><ds:Object $$PAYLOADATTR$$>$$PAYLOADELEMENT$$</ds:Object></ds:Signature><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-AC5903F7D6DFBD4BC114743637261043"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#" $$PAYLOADATTR$$><wsse:SecurityTokenReference $$PAYLOADATTR$$><ds:X509Data $$PAYLOADATTR$$><ds:X509IssuerSerial><ds:X509IssuerName>CN=server</ds:X509IssuerName><ds:X509SerialNumber>1993907142</ds:X509SerialNumber></ds:X509IssuerSerial>$$PAYLOADELEMENT$$</ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>SWugMxZXBbd+zlm+x+piUwn2BVrvac6WwL78EJt/ekVoEhEmhOaQoscBixNgFHLE+FghYJgz8q1WHrNyR3RnwU6jPT1ITfz8HuoSnYP+xjTdYP9q/eP1noCOeOGNeaIVPy47cik+Yei8kZgyOBSinujTAheIixqG2s1XPAkXZKYd36TdK4rt1OgVRUGAqoeNOq88hrt7a2ewUsRr+vy8hkcFEukgMcOU11pRLw+gq4px4WorI/NqzF03/LJJGOVMXkkgD/OkTQXAoPMBdL5wDpjz3CIhWRSMAO3RDT6aLTtdUPZPdKRf836Xfn+l7svkoQXZSXnO4c/UE3whf0fZ3g==</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#ED-AC5903F7D6DFBD4BC114743637261044"/></xenc:ReferenceList></xenc:EncryptedKey>$$PAYLOADELEMENT$$</wsse:Security>$$PAYLOADELEMENT$$</soap:Header>
   <soap:Body wsu:Id="id-AC5903F7D6DFBD4BC114743637262498" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData Id="ED-AC5903F7D6DFBD4BC114743637261044" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"><wsse:Reference URI="#EK-AC5903F7D6DFBD4BC114743637261043"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>dxl8DmEmwBfb0u0rgq+Uj1bCO8EO+ee6OkHefaiUn9gmt9lfuu81MraMLejyRCK3tIN06qXyJlvQpulpSRWqr+df8InZ6mySrmok/DG9qPQ=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body>
</soap:Envelope>